weidong-deng/LittleFS/Libraries/Device/Geehy/APM32F10x/Include/apm32f107xc.h
/*!
 * @file        apm32f107xc.h
 *
 * @brief       CMSIS Cortex-M3 Device Peripheral Access Layer Header File.
 *
 * @details     This file contains all the peripheral register's definitions, bits definitions and memory mapping
 *
 * @version     V1.0.0
 *
 * @date        2026-03-01
 *
 * @attention
 *
 *  Copyright (C) 2026 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

/* Define to prevent recursive inclusion */
#ifndef __APM32F107XC_H
#define __APM32F107XC_H

#ifdef __cplusplus
extern "C" {
#endif

/** @defgroup HSE_Macros
  @{
*/

/**
 * @brief Define Value of the External oscillator in Hz
 */
#ifndef HSE_VALUE
#define HSE_VALUE                  ((uint32_t)25000000)
#endif

/* Time out for HSE start up */
#define HSE_STARTUP_TIMEOUT         ((uint16_t)0x05000)

/* Value of the Internal oscillator in Hz */
#define HSI_VALUE                   ((uint32_t)8000000)

/**@} end of group HSE_Macros */

/** @defgroup Configuraion_for_CMSIS
  @{
*/

/* ===========================  Configuration of the ARM Cortex-M3 Processor and Core Peripherals  =========================== */
#define __CM3_REV                     0x0201U   /*!< CM3 Core Revision                                                         */
#define __NVIC_PRIO_BITS               4        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  0        /*!< MPU present                                                               */
#define __FPU_PRESENT                  0        /*!< FPU present                                                               */

/**@} end of group Configuraion_for_CMSIS */

/** @defgroup Peripheral_Enumerations
  @{
*/

/**
 * @brief APM32F10x Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */
typedef enum
{
    /******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn         = -14,    /*!< Non Maskable Interrupt                              */
    HardFault_IRQn              = -13,    /*!< Hard Fault, all classes of Fault                    */
    MemoryManagement_IRQn       = -12,    /*!< Memory Management Interrupt                         */
    BusFault_IRQn               = -11,    /*!< Bus Fault Interrupt                                 */
    UsageFault_IRQn             = -10,    /*!< Usage Fault Interrupt                               */
    SVCall_IRQn                 = -5,     /*!< SV Call Interrupt                                   */
    DebugMonitor_IRQn           = -4,     /*!< Debug Monitor Interrupt                             */
    PendSV_IRQn                 = -2,     /*!< Pend SV Interrupt                                   */
    SysTick_IRQn                = -1,     /*!< System Tick Interrupt                               */

    /******  APM32 specific Interrupt Numbers *********************************************************/
    WWDT_IRQn                   = 0,      /*!< Window WatchDog Interrupt                            */
    PVD_IRQn                    = 1,      /*!< PVD through EINT Line detection Interrupt            */
    TAMPER_IRQn                 = 2,      /*!< Tamper Interrupt                                     */
    RTC_IRQn                    = 3,      /*!< RTC global Interrupt                                 */
    FLASH_IRQn                  = 4,      /*!< FLASH global Interrupt                               */
    RCM_IRQn                    = 5,      /*!< RCM global Interrupt                                 */
    EINT0_IRQn                  = 6,      /*!< EINT Line0 Interrupt                                 */
    EINT1_IRQn                  = 7,      /*!< EINT Line1 Interrupt                                 */
    EINT2_IRQn                  = 8,      /*!< EINT Line2 Interrupt                                 */
    EINT3_IRQn                  = 9,      /*!< EINT Line3 Interrupt                                 */
    EINT4_IRQn                  = 10,     /*!< EINT Line4 Interrupt                                 */
    DMA1_Channel1_IRQn          = 11,     /*!< DMA1 Channel 1 global Interrupt                      */
    DMA1_Channel2_IRQn          = 12,     /*!< DMA1 Channel 2 global Interrupt                      */
    DMA1_Channel3_IRQn          = 13,     /*!< DMA1 Channel 3 global Interrupt                      */
    DMA1_Channel4_IRQn          = 14,     /*!< DMA1 Channel 4 global Interrupt                      */
    DMA1_Channel5_IRQn          = 15,     /*!< DMA1 Channel 5 global Interrupt                      */
    DMA1_Channel6_IRQn          = 16,     /*!< DMA1 Channel 6 global Interrupt                      */
    DMA1_Channel7_IRQn          = 17,     /*!< DMA1 Channel 7 global Interrupt                      */

    /*  APM32F10X Connectivity-line devices specific Interrupt Numbers */
    ADC1_2_IRQn                 = 18,     /*!< ADC1 and ADC2 global Interrupt                       */
    CAN1_TX_IRQn                = 19,     /*!< CAN1 TX Interrupts                                   */
    CAN1_RX0_IRQn               = 20,     /*!< CAN1 RX0 Interrupts                                  */
    CAN1_RX1_IRQn               = 21,     /*!< CAN1 RX1 Interrupt                                   */
    CAN1_SCE_IRQn               = 22,     /*!< CAN1 SCE Interrupt                                   */
    EINT9_5_IRQn                = 23,     /*!< External Line[9:5] Interrupts                        */
    TMR1_BRK_IRQn               = 24,     /*!< TMR1 Break Interrupt                                 */
    TMR1_UP_IRQn                = 25,     /*!< TMR1 Update Interrupt                                */
    TMR1_TRG_COM_IRQn           = 26,     /*!< TMR1 Trigger and Commutation Interrupt               */
    TMR1_CC_IRQn                = 27,     /*!< TMR1 Capture Compare Interrupt                       */
    TMR2_IRQn                   = 28,     /*!< TMR2 global Interrupt                                */
    TMR3_IRQn                   = 29,     /*!< TMR3 global Interrupt                                */
    TMR4_IRQn                   = 30,     /*!< TMR4 global Interrupt                                */
    I2C1_EV_IRQn                = 31,     /*!< I2C1 Event Interrupt                                 */
    I2C1_ER_IRQn                = 32,     /*!< I2C1 Error Interrupt                                 */
    I2C2_EV_IRQn                = 33,     /*!< I2C2 Event Interrupt                                 */
    I2C2_ER_IRQn                = 34,     /*!< I2C2 Error Interrupt                                 */
    SPI1_IRQn                   = 35,     /*!< SPI1 global Interrupt                                */
    SPI2_IRQn                   = 36,     /*!< SPI2 global Interrupt                                */
    USART1_IRQn                 = 37,     /*!< USART1 global Interrupt                              */
    USART2_IRQn                 = 38,     /*!< USART2 global Interrupt                              */
    USART3_IRQn                 = 39,     /*!< USART3 global Interrupt                              */
    EINT15_10_IRQn              = 40,     /*!< External Line[15:10] Interrupts                      */
    RTCAlarm_IRQn               = 41,     /*!< RTC Alarm through EINT Line Interrupt                */
    OTG_FS_WKUP_IRQn            = 42,     /*!< USB Device WakeUp from suspend through EINT Line Interrupt */
    TMR5_IRQn                   = 50,     /*!< TMR5 global Interrupt                                */
    SPI3_IRQn                   = 51,     /*!< SPI3 global Interrupt                                */
    UART4_IRQn                  = 52,     /*!< UART4 global Interrupt                               */
    UART5_IRQn                  = 53,     /*!< UART5 global Interrupt                               */
    TMR6_IRQn                   = 54,     /*!< TMR6 global Interrupt                                */
    TMR7_IRQn                   = 55,     /*!< TMR7 global Interrupt                                */
    DMA2_Channel1_IRQn          = 56,     /*!< DMA2 Channel 1 global Interrupt                      */
    DMA2_Channel2_IRQn          = 57,     /*!< DMA2 Channel 2 global Interrupt                      */
    DMA2_Channel3_IRQn          = 58,     /*!< DMA2 Channel 3 global Interrupt                      */
    DMA2_Channel4_IRQn          = 59,     /*!< DMA2 Channel 4 global Interrupt                      */
    DMA2_Channel5_IRQn          = 60,     /*!< DMA2 Channel 5 global Interrupt                      */
    ETH_IRQn                    = 61,     /*!< ETH global Interrupt                                 */
    ETH_WKUP_IRQn               = 62,     /*!< ETH Wake up Interrupt                                */
    CAN2_TX_IRQn                = 63,     /*!< CAN2 TX Interrupts                                   */
    CAN2_RX0_IRQn               = 64,     /*!< CAN2 RX0 Interrupts                                  */
    CAN2_RX1_IRQn               = 65,     /*!< CAN2 RX1 Interrupts                                  */
    CAN2_SCE_IRQn               = 66,     /*!< CAN2 SCE Interrupts                                  */
    OTG_FS_IRQn                 = 67,     /*!< OTG FS Interrupts                                    */
} IRQn_Type;

/**@} end of group Peripheral_Enumerations */


